# Вам заданы названия двух дней недели.

# Определите, могла ли в невисокосном году произойти ситуация, что первое число одного месяца выпало на первый из заданных дней недели, а первое число следующего месяца — на второй из заданных дней недели. Оба месяца при этом должны принадлежать к одному году.

# В задаче предполагается использования григорианского календаря, состоящего из 12 месяцев. Количество дней в каждом из 12 месяцев в невисокосном году равняется соответственно: 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31.

# Названия дней недели записаны с помощью строчных английских букв: «monday» (понедельник), «tuesday» (вторник), «wednesday» (среда), «thursday» (четверг), «friday» (пятница), «saturday» (суббота), «sunday» (воскресенье).

# Входные данные
# Входные данные состоят из двух строк, в каждой из которых записано название одного из семи дней недели. Гарантируется, что каждая из строк совпадает с одной какой-то строкой из множества «monday», «tuesday», «wednesday», «thursday», «friday», «saturday», «sunday».

# Выходные данные
# Выведите «YES» (без кавычек), если ситуация, описанная в условии, могла произойти в течение одного невисокосного года. В противном случае выведите «NO» (без кавычек).