# После окончания уроков n групп школьников вышли на улицу и собрались ехать домой к Поликарпу на празднование его дня рождения. Известно, что i-ая группа состоит из si друзей (1 ≤ si ≤ 4), которые не хотят расставаться по пути к Поликарпу. Решено ехать на такси. Каждая машина может вместить не более четырех пассажиров. Какое минимальное количество машин потребуется школьникам, если каждая группа должна целиком находиться в одной из машин такси (но одна машина может вмещать более чем одну группу)?

# Входные данные
# В первой строке записано целое число n (1 ≤ n ≤ 105) — количество групп школьников. Вторая строка содержит последовательность целых чисел s1, s2, ..., sn (1 ≤ si ≤ 4). Числа записаны через пробел, si — количество ребят в i-ой группе.

# Выходные данные
# Выведите единственное число — минимальное необходимое количество такси, чтобы отвезти всех ребят к Поликарпу.
n = int(input())
groups = list(map(int, input().split()))

count_1 = groups.count(1)
count_2 = groups.count(2)
count_3 = groups.count(3)
count_4 = groups.count(4)

# Машины для групп по четыре человека
cars = count_4

# Машины для групп по три человека
cars += count_3

# Машины для групп по два человека
cars += count_2 // 2
count_2 %= 2

# Машины для групп по одному человеку
if count_2 == 1:
    cars += 1
    count_1 -= 2
elif count_2 == 0:
    count_1 -= 4

# Машины для оставшихся групп по одному человеку
cars += (count_1 + 3) // 4

print(cars)

#to be honest
#i need to prepare for my college application and toefl, and im just doing some code
#like man come on
#go and register for the toefl already
