# Вася готовится проходить IQ тест. В этом тесте часто встречаются задания, в которых нужно найти лишнее из n чисел. Вася заметил, что это лишнее число обычно отличается от остальных по четности. Помогите Васе — для проверки своих ответов, ему требуется программа, которая среди заданных n чисел находит отличающееся по четности.

# Входные данные
# В первой строке записано целое число n (3 ≤ n ≤ 100) — количество чисел в задании. Во второй строке через пробел записано n натуральных чисел, не превосходящих 100. Гарантируется, что среди этих чисел ровно одно отличается по четности от остальных.

# Выходные данные
# Выведите номер числа, которое отличается по четности от остальных. Числа нумеруются начиная с 1 в том порядке, в котором они заданы во входных данных.


# Чтение входных данных
n = int(input())
numbers = list(map(int, input().split()))

# Инициализация переменных для подсчета четных и нечетных чисел
even_count = odd_count = 0
last_even_index = last_odd_index = 0

# Проходим по числам и определяем их четность
for i in range(n):
    if numbers[i] % 2 == 0:
        even_count += 1
        last_even_index = i + 1
    else:
        odd_count += 1
        last_odd_index = i + 1

# Определяем, какое число отличается по четности
if even_count == 1:
    print(last_even_index)
else:
    print(last_odd_index)
