# Недавно в вашем городе открылось отделение полиции. Сейчас идет набор кадров для работы в новом отделении. А тем временем, преступления все совершаются в городе.

# Достоверно известно, что один полицейский может расследовать только одно преступление за всю свою жизнь. Если преступление произошло в тот момент, когда в отделении полиции не было ни одного незанятого преступлениями полицейского, то оно так и останется навсегда нераскрытым.

# Вам заданы события в хронологическом порядке. Каждое событие — это: либо совершение преступления, либо прием на работу нового полицейского. Какое минимальное количество преступлений в любом случае останутся нераскрытыми?

# Входные данные
# В первой строке записано целое число n (1 ≤ n ≤ 105) — количество событий. В следующей строке записано n целых чисел, описывающих события, через пробел.

# Если число равняется -1, значит, произошло одно преступление. В противном случае, число будет положительным (не больше 10) и будет равняться количеству полицейских, нанятых в этот момент. События заданы в хронологическом порядке.

# Выходные данные
# Выведите единственное целое число — количество нерасследованных преступлений.

def unresolved_crimes(events):
    police_available = 0
    unresolved_count = 0

    for event in events:
        if event == -1:
            if police_available > 0:
                police_available -= 1
            else:
                unresolved_count += 1
        else:
            police_available += event

    return unresolved_count

# Чтение входных данных
n = int(input())
events = list(map(int, input().split()))

# Вычисление и вывод результата
result = unresolved_crimes(events)
print(result)
