#Задача Четный массив 800

# Вам дан массив a[0…n−1]
#  длины n
# , который состоит из неотрицательных целых чисел. Обратите внимание: массив нумеруется с нуля.

# Назовём массив хорошим, если четность каждой позиции совпадает с четностью элемента в ней. Более формально, массив является хорошим, если для всех i
#  (0≤i≤n−1
# ) выполнено равенство imod2=a[i]mod2
# , где xmod2
#  — остаток от деления x
#  на 2.

# Например, массивы [0,5,2,1
# ] и [0,17,0,3
# ] — хорошие, а массив [2,4,6,7
# ] — плохой, потому что для i=1
#  четность i
#  и a[i]
#  различна: imod2=1mod2=1
# , но a[i]mod2=4mod2=0
# .

# За один ход вы можете взять любые два элемента массива и поменять их местами (эти элементы не обязательно соседние).

# Найдите минимальное количество ходов, за которое можно сделать массив a
#  хорошим, либо укажите, что это сделать невозможно.

# Входные данные
# В первой строке записано одно целое число t
#  (1≤t≤1000
# ) — количество наборов тестовых данных в тесте. Далее следуют t
#  наборов тестовых данных.

# Каждый набор начинается со строки, в которой записано целое число n
#  (1≤n≤40
# ) — размер массива a
# .

# Далее следует строка, содержащая n
#  целых чисел a0,a1,…,an−1
#  (0≤ai≤1000
# ) — исходный массив.

# Выходные данные
# Для каждого набора тестовых данных выведите одно целое число — минимальное количество ходов, за которое можно сделать заданный массив a
#  хорошим, или -1, если это сделать невозможно.