# Посмотрев последний фильм про Гарри Поттера, маленький Геральд решил тоже попрактиковаться в магии. Он нашел в папиной магической книге заклинание, которое превращает любое число в его сумму цифр. И тут Геральду как раз попалось число n. Сколько раз Геральд сможет применить к нему заклинание до того, как число станет однозначным?

# Входные данные
# В первой строке записано единственное целое число n (0 ≤ n ≤ 10100000). Гарантируется, что n не содержит лидирующих нулей.

# Выходные данные
# Выведите, сколько раз можно заменить число на его сумму цифр пока оно не станет однозначным.

